// Task 1
// Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури

// let n = +prompt('write first number');
// let result = 1;
// for(let i = 1; i<=n; i++){
//     result = result * i;
// }
// document.write(result);

// Task 2
// Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

// let result= ''
// for( let i = 1000; i <= 9999; i++ ){
//     result += i +  ' ' ;
// }
// document.write(result);

// Task 3
// Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17 … 55

// let result= ''
// for( let i = 1; i <= 55; i += 2 ){
//     result += i +  ' ' ;
// }
// document.write(result);

// Task 4
// Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60 …
// a_1=90,  d=-5, a_n=90-5n-5>0 => n=18

// let result= ''
// for( let i = 90; i >= 0; i -= 5){
//     result += i +  ' ' ;
// }
// document.write(result);

// Task 5
// Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128 …
// b_1=2, n=20,  q=2, b_n=b_1*q^(n-1)

// let result= ''
// for( let i = 2 , b1=2, n = 20, q=2 ; i <= b1*q**(n-1); i *= 2){
//     result += i +  ' ' ;
// }
// document.write(result);

// Task 6
// Виведіть на екран всі числа в послідовності 2a-1(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.

// let result= ''
// for( let a = 2; a<=10000; a = 2*a-1){
//     result += a +  ' ' ;
// }
// document.write(result);

// Task 7
//Виведіть на екран всі двозначні члени послідовності 2a+200(крок зміни лічильника), де початкове значення змінної a = -166.

// let result= ''
// for( let a = -166; a<100; a = 2*a+200){
//     if( a>=-100){
//         result += a +  ' ' ;
//     }
// }
// document.write(result);

// Task 8
// Написати програму що обчислює піднесення до степеня. В 1й промпт вводиться число,а в 2й промпт степінь. Умови: Степінь може бути додатня, від'ємна або 0.
// Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл!
// a^b = a*a b раз;
// a^-b= 1/a^b;
// a^0 = 1;

//з двома циклами
// let a = +prompt("Введіть число");
// let b = +prompt("Введіть степінь");
// let s = 1;
// let k = 1;
// if (b > 0) {
//   for (let i = 1; i <= b; i++) {
//     s *= a;
//   }
// } else if (b < 0) {
//   for (let i = -1; i >= b; i--) {
//     k *= a;
//     s = 1 / k;
//   }
// }
// document.write(s);



//з одним циклом
let a = +prompt("Введіть число");
let b = +prompt("Введіть степінь");
let s = 1;
let l = b;
if (b < 0) {
  l = -b;
}
for (let i = 1; i <= l; i++) {
  s *= a;
}
if (b < 0) {
    s=1/s
  }

document.write(s);

